W8D1/reddit_on_rails/app/views/subs/show.html.erb

<section class="posts-display">
    <% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1 ORDER BY created_at DESC  [["sub_id", 1]]