w5d4/url_shortener/app/models/shortened_url.rb

    def self.random_code
        url_hash = nil
        while !url_hash || ShortenedUrl.exists?(:short_url => url_hash)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "rvW2Pg05Y9lcES4FE5wpQA"], ["LIMIT", 1]]

    def self.create!(user, long_url)
        short_url = "http://example.com/" + ShortenedUrl.random_code[0...5]
        ShortenedUrl.create({:user_id => user.id, :long_url => long_url, :short_url => short_url})
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.asdlkjfalskdfjlaksf.com"], ["short_url", "http://example.com/rvW2P"], ["user_id", 2], ["created_at", "2021-04-16 00:17:44.143611"], ["updated_at", "2021-04-16 00:17:44.143611"]]