w5d4/url_shortener/app/models/visit.rb

  def self.record_visit!(user, shortened_url)
    Visit.create(shortened_url: shortened_url, user_id: user.id)
---
INSERT INTO "visits" ("user_id", "shortened_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["shortened_url", "http://example.com/1HPCE"], ["created_at", "2021-04-16 00:22:52.451225"], ["updated_at", "2021-04-16 00:22:52.451225"]]