W11D1/todo_app/app/controllers/api/todos_controller.rb

  def create
    todo = Todo.new(todo_params)
    if todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"