W8D1/reddit_on_rails/app/controllers/posts_controller.rb

    def new
        @post = Post.new
        @sub = Sub.find_by(id: params[:sub_id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        @post.sub_id = params[:sub_id]
        if @post.save
---
INSERT INTO "posts" ("title", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "post"], ["content", "content"], ["sub_id", 1], ["author_id", 1], ["created_at", "2021-05-03 22:12:31.036862"], ["updated_at", "2021-05-03 22:12:31.036862"]]

    def show
        @post = Post.find_by(id: params[:id]).includes(:sub)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]