W8D1/reddit_on_rails/app/controllers/subs_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1 ORDER BY created_at DESC  [["sub_id", 1]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @sub = Sub.find_by(id: params[:id]).includes(:posts)