W7D2/music_app/app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" INNER JOIN "bands" ON "bands"."id" = "albums"."band_id" ORDER BY "band_name" ASC
---
    def index
        @albums = Album.joins(:band).order('band_name ASC').all.includes(:band)

INSERT INTO "albums" ("created_at", "updated_at", "title", "year", "recording_type", "band_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2021-04-27 23:38:04.127978"], ["updated_at", "2021-04-27 23:38:04.127978"], ["title", "Abbey Road"], ["year", 1969], ["recording_type", "studio"], ["band_id", 1]]
---
    def create
        album = Album.new(album_params)
        album.band_id = params[:band_id]
        if album.save