W7D2/music_app/app/controllers/bands_controller.rb

    def create
        band = Band.new(band_params)
        if band.save
---
INSERT INTO "bands" ("band_name", "created_at", "updated_at", "formation_year", "location") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_name", "The Beatles"], ["created_at", "2021-04-27 21:35:31.847868"], ["updated_at", "2021-04-27 21:35:31.847868"], ["formation_year", 1960], ["location", "Liverpool, UK"]]