W6D3/art_share/app/controllers/artwork_shares_controller.rb

    def create
        if ArtworkShare.find_by(params.require(:artwork_share).permit(:artwork_id, :viewer_id)).nil?
            share = ArtworkShare.new(params.require(:artwork_share).permit(:artwork_id, :viewer_id))
            if share.save
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."artwork_id" IS NULL AND "artwork_shares"."viewer_id" IS NULL LIMIT $1  [["LIMIT", 1]]
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 6], ["viewer_id", 11]]

    def destroy
        share = ArtworkShare.find_by(params.require(:artwork_share).permit(:artwork_id, :viewer_id))
        if !share.nil?
            if share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."artwork_id" = $1 AND "artwork_shares"."viewer_id" = $2 LIMIT $3  [["artwork_id", 6], ["viewer_id", 11], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 8]]