W6D4/ninety_nine_cats/app/controllers/cats_controller.rb

  def destroy
    cat = Cat.find_by(id: params[:id])
    if cat.destroy
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 4]]